Интерлинк_УНФ.Интерлинк/src/InformationRegisters/Интерлинк_УпаковочныеЛисты/Интерлинк_УпаковочныеЛисты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Интерлинк_УпаковочныеЛисты</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерСТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасходнаяНакладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетФактура</name>
    <type>
      <types>DocumentRef.СчетФактура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Паллета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Интерлинк_УНФ.Интерлинк/src/CommonForms/Интерлинк_УпаковочныйЛист/Module.bsl
&НаСервере
Функция МассивОтбора()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Интерлинк_УпаковочныеЛисты.ЗаказПокупателя КАК ЗаказПокупателя
	|ИЗ
	|	РегистрСведений.Интерлинк_УпаковочныеЛисты КАК Интерлинк_УпаковочныеЛисты"
	;
	Запрос = Новый Запрос(ТекстЗапроса);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказПокупателя");
КонецФункции

&НаКлиенте
Процедура Подобрать(Команда)
	
	НастройкиКомпоновкиДанных = Новый НастройкиКомпоновкиДанных;
	
	ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ПравоеЗначение = МассивОтбора();
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ПравоеЗначение = МассивОтбора();
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, ФиксированныеНастройки", Ложь, Истина, НастройкиКомпоновкиДанных);
	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаВыбора",  ПараметрыПодбора, Элементы.ТаблицаЗаказов);

КонецПроцедуры

&НаКлиенте
Процедура ДокументыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДокументОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ДокументОбработкаВыбораНаСервере(МассивВыбора)
	Для Каждого Значение Из МассивВыбора Цикл
		Если Документы.НайтиСтроки(Новый Структура("ЗаказПокупателя", Значение)).Количество() = 0 Тогда
			НоваяСтрока = Документы.Добавить();
			НоваяСтрока.ЗаказПокупателя = Значение;

			НоваяСтрока.РасходнаяНакладная = Документы.РасходнаяНакладная.НайтиПоРеквизиту("Заказ", Значение);
			СчетФактура = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйСчетФактуру(НоваяСтрока.РасходнаяНакладная, Ложь);
			Если СчетФактура <> Неопределено Тогда
				НоваяСтрока.СчетФактура = СчетФактура.Ссылка;
			Иначе
				НоваяСтрока.СчетФактура = Неопределено;
			КонецЕсли;
			
//			Если НЕ ТолькоЧтение Тогда 
//				Строка.Номер = Строка(Число(ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Заказ.Дата, Заказ.Номер, Заказ.Организация.Префикс)));
//				Строка.Дата = Заказ.Дата;
//				Строка.Договор = Заказ.Договор;
				
				НоваяСтрока.Магазин = Значение.Грузополучатель;
			
//				Строка.ЕстьРТиУ = ЗначениеЗаполнено(Строка.РТиУ);
//				Строка.ЕстьСФ = ЗначениеЗаполнено(Строка.СчетФактура);	
//			КонецЕсли;

			Для Каждого СтрокаЗапасов Из Значение.Запасы Цикл
				НоваяСтрокаТоваров = ТоварыКРазмещению.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров, НоваяСтрока);
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров, СтрокаЗапасов);
				НоваяСтрокаТоваров.НомерСТС = НомерСТС;
			КонецЦикла;	
					
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НомерСТС") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Интерлинк_УпаковочныеЛисты.ЗаказПокупателя,
		|	Интерлинк_УпаковочныеЛисты.РасходнаяНакладная,
		|	Интерлинк_УпаковочныеЛисты.СчетФактура,
		|	Интерлинк_УпаковочныеЛисты.Магазин,
		|ИЗ
		|	РегистрСведений.Интерлинк_УпаковочныеЛисты КАК Интерлинк_УпаковочныеЛисты
		|ГДЕ
		|	Интерлинк_УпаковочныеЛисты.НомерСТС = &НомерСТС
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|
		|	Интерлинк_УпаковочныеЛисты.НомерСТС,
		|	Интерлинк_УпаковочныеЛисты.Магазин,
		|	Интерлинк_УпаковочныеЛисты.Номенклатура,
		|	Интерлинк_УпаковочныеЛисты.ЗаказПокупателя,
		|	Интерлинк_УпаковочныеЛисты.РасходнаяНакладная,
		|	Интерлинк_УпаковочныеЛисты.СчетФактура,
		|	Интерлинк_УпаковочныеЛисты.Паллета,
		|	Интерлинк_УпаковочныеЛисты.Количество,
		|	Интерлинк_УпаковочныеЛисты.Номенклатура.Объем * Интерлинк_УпаковочныеЛисты.Количество КАК Объем
		|ИЗ
		|	РегистрСведений.Интерлинк_УпаковочныеЛисты КАК Интерлинк_УпаковочныеЛисты
		|ГДЕ
		|	Интерлинк_УпаковочныеЛисты.НомерСТС = &НомерСТС
		|	И Интерлинк_УпаковочныеЛисты.Паллета = 0
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Интерлинк_УпаковочныеЛисты.Паллета
		|ИЗ
		|	РегистрСведений.Интерлинк_УпаковочныеЛисты КАК Интерлинк_УпаковочныеЛисты
		|ГДЕ
		|	Интерлинк_УпаковочныеЛисты.НомерСТС = &НомерСТС
		|	И Интерлинк_УпаковочныеЛисты.Паллета > 0
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Интерлинк_УпаковочныеЛисты.НомерСТС,
		|	Интерлинк_УпаковочныеЛисты.Магазин,
		|	Интерлинк_УпаковочныеЛисты.Номенклатура,
		|	Интерлинк_УпаковочныеЛисты.ЗаказПокупателя,
		|	Интерлинк_УпаковочныеЛисты.РасходнаяНакладная,
		|	Интерлинк_УпаковочныеЛисты.СчетФактура,
		|	Интерлинк_УпаковочныеЛисты.Паллета,
		|	Интерлинк_УпаковочныеЛисты.Количество,
		|	Интерлинк_УпаковочныеЛисты.Номенклатура.Объем * Интерлинк_УпаковочныеЛисты.Количество КАК Объем
		|ИЗ
		|	РегистрСведений.Интерлинк_УпаковочныеЛисты КАК Интерлинк_УпаковочныеЛисты
		|ГДЕ
		|	Интерлинк_УпаковочныеЛисты.НомерСТС = &НомерСТС
		|	И Интерлинк_УпаковочныеЛисты.Паллета > 0"
		;
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("НомерСТС", Параметры.НомерСТС);
		// получим данные для заполнения формы
		Результаты = Запрос.ВыполнитьПакет();
		Индекс = Результаты.Количество();
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результаты[Индекс-5].Выгрузить()[0]);
		Документы.Загрузить(Результаты[Индекс-4].Выгрузить());
		ТоварыКРазмещению.Загрузить(Результаты[Индекс-3].Выгрузить());
		Паллета.Загрузить(Результаты[Индекс-2].Выгрузить().ВыгрузитьКолонку("Паллета"));
		ТоварыНаПаллетах.Загрузить(Результаты[Индекс-1].Выгрузить());
	КонецЕсли;
		
КонецПроцедуры
